OpenFOAM-6-cantera/tutorials/combustion/coldEngineFoam/freePiston/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/caseSettings"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $:internalField.T;

boundaryField
{
    back
    {
        type            wedge;
    }

    front
    {
        $back;
    }

    liner
    {
        $:wall.T;
    }

    cylinderHead
    {
        $liner;
    }

    piston
    {
        $liner;
    }
}


// ************************************************************************* //
